Revit 2027 API
CoordinationModelLinkData Methods
The CoordinationModelLinkData type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCategoryNames |  Return the category names of all elements inside the current Coordination Model Link from Autodesk Docs.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPathType |  Returns the path type of the Coordination Model link.
 For a Coordination Model from Autodesk Docs, path type is Cloud.
 For a local Coordination Model, path type can be Absolute or Relative.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace